{
  "header": {
    "full_name": "Станислав Соболев",
    "role_title": "Senior Go Developer",
    "nickname": "Стан",
    "tags": "Senior, Менторинг, Team Lead",
    "stack": "Go, Java",
    "contact": {
      "timezone": "GMT+3",
      "email": "iamjacke@gmail.com",
      "github": "github.com/Jacke",
      "phone": "",
      "availability": "Удалённо/Полная занятость, Удалённо/Частичная занятость, Почасовая",
      "legal_entity": "UK LLC, Latvian LLC, Deel/Payoneer",
      "location": "",
      "english": ""
    }
  },
  "summary": {
    "paragraph": "Кросс-стек инженер с более чем 10-летним опытом, специализирующийся на построении распределённых систем. Опыт в оценке задач, построении команд и внедрении масштабируемых решений. Энтузиаст и преданный профессионал, постоянно ищущий инновационные подходы.",
    "about": ""
  },
  "key_skills_line": "Go, Java",
  "skills": [
    {
      "title": "Scala / Java (Back-End)",
      "bullets": [
        "Коммерческий опыт как разработчик и тимлид, сильный сторонник функционального программирования с акцентом на простоту и минимализм.",
        "Успешно мигрировал 7 проектов и инициировал 6 новых проектов в экосистеме ZIO и Arrow, что привело к улучшению читаемости кода, повышению производительности и стабильности выполнения.",
        "Использовал Akka для проектирования и реализации сложной микросервисной архитектуры, включающей обнаружение сервисов, управление конфигурацией, балансировку нагрузки и отказоустойчивость.",
        "Достиг субмиллисекундной производительности с использованием Netty, Aeron, CassandraDB для обработки более 60 000 активных сессий.",
        "Спроектировал высокопроизводительную транспортную систему с использованием GraphQL/Protobuf (gRPC)/Apache Avro для Web, Mobile и IoT стеков."
      ]
    }
  ],
  "experience": [
    {
      "company": "Мвидео",
      "dates": "06/2022 - Настоящее время",
      "duration": "2 года",
      "company_desc": "Ведущая розничная компания, специализирующаяся на электронике и бытовой технике.",
      "company_url": "https://mvideo.ru",
      "role": "Senior Full-Stack Developer",
      "employment": "Полная занятость",
      "bullets": [
        "Возглавил разработку нового продукта с нуля, интегрировавшего 40 000 магазинов и 160 000 пользователей в единую платформу.",
        "Спроектировал и реализовал функции управления и распределения бонусов, отслеживания эффективности пользователей и отображения результатов KPI.",
        "Спроектировал масштабируемую бэкенд-систему для эффективной обработки больших объёмов данных с обеспечением обработки и отчётности в реальном времени.",
        "Успешно интегрировал данные из системы SAP, справляясь со сложными задачами миграции и синхронизации данных.",
        "Интегрировал различные сторонние сервисы и API для расширения функциональности платформы и обеспечения бесперебойной синхронизации данных.",
        "Провёл обширное тестирование производительности и оптимизацию для гарантии надёжности и отзывчивости системы."
      ],
      "technologies": "Scala, Java, PostgreSQL, Docker, REST API, Kubernetes (k8s), SAP"
    },
    {
      "company": "EEG",
      "dates": "07/2021 - 06/2023",
      "duration": "2 года",
      "company_desc": "Фулстек-компания в сфере киберспорта и онлайн-гемблинга, работающая на волне роста видеоигр.",
      "company_url": "https://www.eegpartners.com/",
      "role": "Senior Scala Developer",
      "employment": "Полная занятость",
      "bullets": [
        "Руководил разработкой продвинутой гемблинг-платформы, доведя прототип до продакшена с соблюдением требований compliance.",
        "Минимизировал инциденты при запуске и сократил количество обращений в поддержку.",
        "Сократил время регистрации пользователей с 10 минут до 1 минуты благодаря улучшениям структуры UX.",
        "Предложил элементы инфраструктуры, снизившие затраты на обслуживание и упростившие внесение изменений.",
        "Построил ML-модель предотвращения мошенничества с точностью обнаружения регистраций более 90% и сократил время простоя вдвое.",
        "Улучшил время обработки с 2,5 секунд до 30 мс за счёт внедрения распределённого балансировщика нагрузки."
      ],
      "technologies": "Scala, Akka, Kubernetes (k8s), PostgreSQL"
    },
    {
      "company": "Tawasal",
      "dates": "02/2020 - 06/2021",
      "duration": "2 года",
      "company_desc": "Популярный мессенджер в ОАЭ и суперапп для аренды, еды и билетов.",
      "company_url": "https://tawasal.ae/",
      "role": "Senior Scala Developer",
      "employment": "Полная занятость",
      "bullets": [
        "Модифицировал высоконагруженные сервисы мессенджера и спроектировал инфраструктуру для управления данными и взаимодействия модулей.",
        "Организовал архитектуру для 100 000+ пользователей, обеспечив 5 инстансов при повышении производительности за счёт использования RAM.",
        "Построил SOA-интеграцию для суперприложения, сократив время разработки интеграций с 1 месяца до 1,5 недель.",
        "Отбирал и менторил новых членов команды, координировал создание важной документации.",
        "Исследовал и интегрировал распределённую облачную архитектуру, увеличив масштабируемость на 40% и снизив затраты на 50%."
      ],
      "technologies": "ZIO, Akka, F#, Nix, C++"
    },
    {
      "company": "Yzer",
      "dates": "08/2019 - 09/2020",
      "duration": "2 года",
      "company_desc": "Вирусный мессенджер в ОАЭ с функциями автоматического перевода сообщений.",
      "company_url": "https://appadvice.com/app/yzerchat-chat-and-video-calls/1398177737",
      "role": "Senior Scala Consultant",
      "employment": "Частичная занятость",
      "bullets": [
        "Моделировал критические модули приложения, консультировал по разработке и построил транспорт данных для высоконагруженных микросервисов.",
        "Снизил задержку с 500 мс до 59 мс за счёт низкоуровневой оптимизации.",
        "Повлиял на архитектуру масштабирования и оптимизировал бюджет проекта на 3 месяца, поддерживая 56 000 пользователей в день.",
        "Построил высоконагруженную модель запросов, уменьшив узкие места на 50% и улучшив визуализацию производительности.",
        "Оптимизировал облачную архитектуру с on-prem инструментами, улучшив время отклика на 100 мс и сократив использование серверов в 10 раз."
      ],
      "technologies": "Scala, Java, Protobuf, Rust, WebAssembly"
    },
    {
      "company": "Bolti",
      "dates": "10/2018 - 08/2019",
      "duration": "2 года",
      "company_desc": "Мессенджер / Платформа чат-ботов.",
      "company_url": "",
      "role": "Senior Scala Developer",
      "employment": "Полная занятость",
      "bullets": [
        "Провёл реверс-инжиниринг протокола MTProto от Telegram и реализовал бэкенд-функции для множества целевых устройств.",
        "Реализовал 95% общей функциональности Telegram на платформе.",
        "Спроектировал архитектуру, обслуживающую 15 000 ежедневных активных пользователей на одном сервере."
      ],
      "technologies": "Scala, ZIO, C++, Kubernetes (k8s), Babel"
    },
    {
      "company": "Buro",
      "dates": "01/2017 - 12/2018",
      "duration": "2 года",
      "company_desc": "SaaS для регистрации C-corp и LLC с банковской интеграцией.",
      "company_url": "https://buro.app",
      "role": "Сооснователь, CTO",
      "employment": "Полная занятость",
      "bullets": [
        "Построил зашифрованный туннель обмена сообщениями с банками для передачи KYC-заявок.",
        "Создал систему, обрабатывающую до 500 заявок на регистрацию в день.",
        "Нанял и менторил команду из 7 разработчиков, увеличив скорость выполнения на 35%.",
        "Разработал систему обнаружения мошенничества, сократившую время валидации документов с 2 часов до 5 минут."
      ],
      "technologies": "Kotlin, Java, Spring, Spark, Thrift, Kafka, PostgreSQL"
    },
    {
      "company": "Minority",
      "dates": "12/2015 - 12/2016",
      "duration": "2 года",
      "company_desc": "Платформа управления рабочим процессом для описания ежедневной деятельности и автоматизации рутинных задач.",
      "company_url": "https://minorityapp.com/",
      "role": "Сооснователь, CEO, Full stack developer",
      "employment": "Полная занятость",
      "bullets": [
        "Исследовал рыночные возможности, увеличив потенциальную выручку на 30% и сформировав стратегические партнёрства.",
        "Создал прототип, построил маркетинговую стратегию и определил ключевые каналы продвижения.",
        "Определил процесс обратной связи и запустил быстрый agile-цикл разработки.",
        "Завершил программу стартап-акселератора и выиграл награду Best SaaS с грантом $10 000."
      ],
      "technologies": "Java, Spring, Hibernate, PostgreSQL, Redis"
    }
  ],
  "education": {
    "dates": "09/2011 - 05/2017",
    "school": "Санкт-Петербургский государственный университет (СПбГУ)",
    "degree": "Магистр компьютерных наук"
  },
  "extras": {
    "hobbies": ""
  }
}
