{
  "header": {
    "full_name": "Станислав Соболев",
    "role_title": "Engineering Manager / Tech Lead",
    "nickname": "Стан",
    "tags": "Лидерство, Построение команд, Стратегия",
    "stack": "Go, Scala, Java",
    "contact": {
      "timezone": "GMT+3",
      "email": "iamjacke@gmail.com",
      "github": "github.com/Jacke",
      "phone": "",
      "availability": "Удалённо/Полная занятость, Удалённо/Частичная занятость",
      "legal_entity": "UK LLC, Latvian LLC, Deel/Payoneer",
      "location": "",
      "english": ""
    }
  },
  "summary": {
    "paragraph": "Технический лидер с более чем 10-летним опытом построения и масштабирования технических команд. Доказанная способность трансформировать прототипы в продакшен-системы, менторить инженеров и руководить кросс-функциональными инициативами. Основал и возглавлял несколько стартапов, сочетая техническое превосходство со стратегическим бизнес-мышлением.",
    "about": ""
  },
  "key_skills_line": "Лидерство команды, Техническая стратегия, Менторинг",
  "skills": [
    {
      "title": "Лидерство и построение команды",
      "bullets": [
        "Нанимал, менторил и руководил инженерными командами до 7 разработчиков, достигая ускорения доставки на 35%.",
        "Внедрял процессы обратной связи и agile-циклы разработки для непрерывного улучшения.",
        "Отбирал и онбордил новых членов команды, создавая исчерпывающую документацию для передачи знаний.",
        "Выстраивал кросс-функциональные партнёрства между инженерами, продуктом и бизнес-стейкхолдерами."
      ]
    },
    {
      "title": "Стратегическое планирование и исполнение",
      "bullets": [
        "Исследовал рыночные возможности, увеличивая потенциальную выручку на 30% через стратегические партнёрства.",
        "Определял продуктовые роадмапы и маркетинговые стратегии, выявляя ключевые каналы продвижения.",
        "Оптимизировал бюджеты проектов на 3 месяца, сохраняя качество и удовлетворённость пользователей.",
        "Завершил программу стартап-акселератора, выиграв награду Best SaaS с грантом $10 000."
      ]
    },
    {
      "title": "Улучшение процессов и операций",
      "bullets": [
        "Сократил время регистрации пользователей с 10 минут до 1 минуты за счёт улучшений UX.",
        "Минимизировал инциденты при запуске, сократив обращения в поддержку через проактивные меры качества.",
        "Предложил изменения инфраструктуры, снизившие затраты на обслуживание и улучшившие скорость изменений.",
        "Построил SOA-интеграционный фреймворк, сокративший время разработки с 1 месяца до 1,5 недель."
      ]
    }
  ],
  "experience": [
    {
      "company": "Мвидео",
      "dates": "06/2022 - Настоящее время",
      "duration": "2 года",
      "company_desc": "Ведущая розничная компания, специализирующаяся на электронике и бытовой технике.",
      "company_url": "https://mvideo.ru",
      "role": "Tech Lead / Senior Developer",
      "employment": "Полная занятость",
      "bullets": [
        "Руководил кросс-функциональной командой, разрабатывающей единую платформу для 40 000 магазинов и 160 000 пользователей.",
        "Координировал работу с командами продукта, дизайна и бизнеса для определения требований и приоритетов функций.",
        "Обеспечивал согласованность стейкхолдеров по функциям отслеживания KPI и управления производительностью.",
        "Управлял сложным проектом интеграции с SAP, обеспечивая плавную миграцию данных между корпоративными системами."
      ],
      "technologies": "Scala, Java, PostgreSQL, Docker, REST API, Kubernetes (k8s), SAP"
    },
    {
      "company": "EEG",
      "dates": "07/2021 - 06/2023",
      "duration": "2 года",
      "company_desc": "Фулстек-компания в сфере киберспорта и онлайн-гемблинга.",
      "company_url": "https://www.eegpartners.com/",
      "role": "Senior Developer / Tech Lead",
      "employment": "Полная занятость",
      "bullets": [
        "Руководил разработкой гемблинг-платформы от прототипа до продакшена с соблюдением compliance.",
        "Минимизировал инциденты при запуске и сократил обращения в поддержку через проактивные меры качества.",
        "Улучшил пользовательский опыт, сократив время регистрации с 10 минут до 1 минуты.",
        "Предложил улучшения инфраструктуры, снизившие затраты на обслуживание и улучшившие скорость команды."
      ],
      "technologies": "Scala, Akka, Kubernetes (k8s), PostgreSQL"
    },
    {
      "company": "Tawasal",
      "dates": "02/2020 - 06/2021",
      "duration": "2 года",
      "company_desc": "Популярный мессенджер в ОАЭ и суперапп для аренды, еды и билетов.",
      "company_url": "https://tawasal.ae/",
      "role": "Senior Developer / Team Lead",
      "employment": "Полная занятость",
      "bullets": [
        "Руководил архитектурными решениями для высоконагруженного мессенджера, обслуживающего 100 000+ пользователей.",
        "Отбирал и менторил новых членов команды, создавая необходимую документацию для передачи знаний.",
        "Построил интеграционный фреймворк, сокративший время кросс-командной разработки с 1 месяца до 1,5 недель.",
        "Исследовал и продвигал распределённую облачную архитектуру, снизившую затраты на 50%."
      ],
      "technologies": "ZIO, Akka, F#, Nix, C++"
    },
    {
      "company": "Yzer",
      "dates": "08/2019 - 09/2020",
      "duration": "1 год",
      "company_desc": "Вирусный мессенджер в ОАЭ с функциями автоматического перевода сообщений.",
      "company_url": "https://appadvice.com/app/yzerchat-chat-and-video-calls/1398177737",
      "role": "Senior Consultant",
      "employment": "Частичная занятость",
      "bullets": [
        "Консультировал по стратегии разработки и моделировал критические модули приложения.",
        "Повлиял на архитектуру масштабирования, оптимизировав бюджет проекта на 3 месяца.",
        "Построил инструменты визуализации производительности, улучшив выявление узких мест на 50%.",
        "Поддерживал рост платформы до 56 000 ежедневных активных пользователей через стратегические технические решения."
      ],
      "technologies": "Scala, Java, Protobuf, Rust, WebAssembly"
    },
    {
      "company": "Buro",
      "dates": "01/2017 - 12/2018",
      "duration": "2 года",
      "company_desc": "SaaS для регистрации C-corp и LLC с банковской интеграцией.",
      "company_url": "https://buro.app",
      "role": "Сооснователь, CTO",
      "employment": "Полная занятость",
      "bullets": [
        "Основал и руководил технической стратегией B2B SaaS стартапа в сфере legal tech.",
        "Нанял и менторил команду из 7 разработчиков, увеличив скорость завершения на 35%.",
        "Построил систему, обрабатывающую 500 заявок на регистрацию в день с банковскими интеграциями.",
        "Разработал систему обнаружения мошенничества, сократившую валидацию документов с 2 часов до 5 минут."
      ],
      "technologies": "Kotlin, Java, Spring, Spark, Thrift, Kafka, PostgreSQL"
    },
    {
      "company": "Minority",
      "dates": "12/2015 - 12/2016",
      "duration": "1 год",
      "company_desc": "Платформа управления рабочим процессом для описания ежедневной деятельности и автоматизации рутинных задач.",
      "company_url": "https://minorityapp.com/",
      "role": "Сооснователь, CEO",
      "employment": "Полная занятость",
      "bullets": [
        "Основал и возглавлял стартап от идеи через акселератор до выхода на рынок.",
        "Исследовал рыночные возможности, увеличив потенциальную выручку на 30% через стратегические партнёрства.",
        "Построил маркетинговую стратегию и определил ключевые каналы продвижения для B2B SaaS.",
        "Выиграл награду Best SaaS с грантом $10 000, завершив программу стартап-акселератора."
      ],
      "technologies": "Java, Spring, Hibernate, PostgreSQL, Redis"
    }
  ],
  "education": {
    "dates": "09/2011 - 05/2017",
    "school": "Санкт-Петербургский государственный университет (СПбГУ)",
    "degree": "Магистр компьютерных наук"
  },
  "extras": {
    "hobbies": ""
  }
}
